def get_regions():
    return [
        ("Самарқанд",18),
            ("Тошкент",27),
             ("Aнгрен",43),
              ("Aндижон",1),
               ("Бекобод",2),
                ("Бухоро",4),
                 ("Газли",46),
                  ("Денов",6),
                   ("Деҳқонобод",84),
                    ("Жиззах",9),
                     ("Конимех",59),
                      ("Косон",86),
                       ("Навоий",94),
                        ("Наманган",15),
                         ("Нукус",16),
                          ("ОЛОТ",45),
                           ("Риштон",39),
                            ("Урганч",78),
                             ("Фарғона",37),
                              ("Хива",21),
                               ("Ғузор",85),
                                ("Қарши",93),
                                 ("Қоракўл",48),
                                  ("Қоровулбозор", 47),
                                   ('Aрнасой', 52),
                                    ('Aшхабот', 90),
                                     ('Душанбе', 89),
                                      ('Зарафшон',61),
                                       ('Зомин', 50),
                                        ('Муборак', 88),
                                        ('Нурота', 17),
                                        ('Олмаота',41),
                                        ('Қўқон', 26),
                                        ('Янгибозор', 81)
                                   ]
def get_region(region_id):
    a=get_regions()

    for i in a:
        if i[1] == region_id:
            return i[0]